app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'edi'
 LIMIT 1
---
	public function saveLogin()
	{
		$session = session();
		$model = new UserModel();
		$username = $this->request->getVar('username');
		$password = $this->request->getVar('password');
		$dataModel = $model->where('username', $username)->first();