app/Controllers/User.php

    public function index()
    {
        $model = new UserModel();
        $data['user'] = $model->findAll();
---
SELECT *
FROM `user`

    public function tambah_user()
    {
        $model = new UserModel();
        $model->insert(
            [
                'username' => $_POST['username'],
                'password' => $_POST['password'],
                'nama'     => $_POST['nama'],
                'level'    => $_POST['level'],
            ]);
---
INSERT INTO `user` (`username`, `password`, `nama`, `level`) VALUES ('edi', '12345678', 'Edi', 'kepala')